<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use TCPDF;


class PDFController extends Controller
{
    public function generatePDF()
    {
        // สร้าง instance ของ TCPDF
        $pdf = new TCPDF(PDF_PAGE_ORIENTATION, PDF_UNIT, PDF_PAGE_FORMAT, true, 'UTF-8', false);

        // ตั้งค่าข้อมูลเอกสาร
        $pdf->SetCreator('Laravel');
        $pdf->SetAuthor('Khon Kaen University');
        $pdf->SetTitle('หนังสือยินยอมผู้ปกครอง');
        $pdf->SetSubject('หนังสือยินยอมให้ฝึกงาน');

        // ตั้งค่าขอบกระดาษ
        $pdf->SetMargins(25, 20, 25);
        $pdf->SetAutoPageBreak(TRUE, 10);

        // เพิ่มหน้า PDF
        $pdf->AddPage();

        // ตั้งค่าฟอนต์ (TH SarabunPSK)
        $pdf->SetFont('THSarabun', '', 15);

        // เริ่มต้นสร้างเนื้อหา
        $html = '<p style="text-align: center;">ฝึกงานนักศึกษา  สาขาวิชาวิทยาการคอมพิวเตอร์ วิทยาลัยการคอมพิวเตอร์หนังสือยินยอมผู้ปกครอง</p>
        <p style="text-align: right;">เขียนที่ ...............................................</p>
        <p style="text-align: right;">วันที่ ....... เดือน ....................... พ.ศ. ...........</p>
        <p>เรียน หัวหน้าสาขาวิชา/ประธานกรรมการบริหารหลักสูตร ...............................................</p>
        <p>&emsp;&emsp;ด้วยข้าพเจ้า นาย/นาง/นางสาว .................................................... ผู้ปกครองของ นาย/นางสาว .................................................... รหัสประจำตัว ........................ หลักสูตร .................................................... สาขาวิชาวิทยาการคอมพิวเตอร์ วิทยาลัยการคอมพิวเตอร์ มหาวิทยาลัยขอนแก่น ยินยอมให้ นาย/นางสาว .................................................... ซึ่งเกี่ยวข้องกับข้าพเจ้าโดยเป็น ........................ เดินทางไปฝึกงานด้าน .................................................... ในระหว่างวันที่ ....... เดือน ....................... พ.ศ. ........... ถึงวันที่ ....... เดือน ....................... พ.ศ. ........... รวมระยะเวลา ....... วัน ณ บริษัท/หน่วยงาน .................................................... จังหวัด ...................</p>
        <p>&emsp;&emsp;โดยข้าพเจ้าได้พิจารณาแล้วว่าสถานประกอบการที่นักศึกษาไปฝึกงานมีมาตรการรองรับที่ปลอดภัย รวมทั้งมีมาตรการป้องกันเป็นอย่างดี โดยนักศึกษาได้ติดต่อประสานงานไปยังบริษัท/หน่วยงานเรียบร้อยแล้ว โดยมีการปฏิบัติงานดังนี้</p>
        <ul>
        <li>นักศึกษาเดินทางไปปฏิบัติงานในบริษัท/หน่วยงาน</li>
        <li>บริษัท/หน่วยงานปรับเปลี่ยนรูปแบบการฝึกงานเป็น WFH</li>
        <li>บริษัท/หน่วยงานรูปแบบการฝึกงานเป็น Hybrid (ทั้ง Online และ Onsite)</li>
        </ul>
        <p>&emsp;&emsp;จึงยินยอมให้ นาย/นางสาว .................................................... ที่แจ้งความประสงค์และยืนยันที่จะไปฝึกงานในช่วงระยะเวลาดังกล่าว</p>

        <p style="text-align: center;">ลงชื่อ ............................................. นักศึกษา</p>
        <p style="text-align: center;">(...................................................)</p>
        <p style="text-align: center;">วันที่ ...............................</p>

        <p>ลงชื่อ .............................................................. ผู้ปกครองนักศึกษา</p>
        <p>(.............................................................)</p>

        <p>ชื่อผู้ที่สามารถติดต่อได้ในกรณีฉุกเฉิน นาย/นาง/นางสาว ....................................................</p>
        <p>มีความเกี่ยวข้องเป็น ...................................... เบอร์โทรศัพท์ ......................................</p>';

        $pdf->writeHTML($html, true, false, true, false, '');

        // ส่งไฟล์ PDF กลับไปแสดงผล
        return response($pdf->Output('หนังสือยินยอม.pdf', 'I'))
            ->header('Content-Type', 'application/pdf');
    }
}

